In [2]:
import pandas as pd
import numpy as np

In [4]:
np.random.seed(101)
df=pd.DataFrame(data=np.random.randn(5,5),index='a b c d e'.split(),columns=['Val1 Val2 Val3 Val4 Val5'.split()])
df

       Val1      Val2      Val3      Val4      Val5
a  2.706850  0.628133  0.907969  0.503826  0.651118
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
d  0.955057  0.190794  1.978757  2.605967  0.683509
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

# Single Selection

In [10]:
print(df['Val1'])
df.Val1
df['Val1'].values

       Val1
a  2.706850
b -0.319318
c  0.528813
d  0.955057
e  0.302665

array([[ 2.70684984],
       [-0.31931804],
       [ 0.52881349],
       [ 0.95505651],
       [ 0.30266545]])

In [15]:
df[['Val1']]['a':'c']

       Val1
a  2.706850
b -0.319318
c  0.528813

In [12]:
df[['Val1']][0:3]

       Val1
a  2.706850
b -0.319318
c  0.528813

In [13]:
df[['Val1']][::-1]

       Val1
e  0.302665
d  0.955057
c  0.528813
b -0.319318
a  2.706850

In [16]:
np.random.seed(101)
df=pd.DataFrame(data=np.random.randn(5,5),index='a b c d e'.split(),columns=['Val1 Val2 Val3 Val4 Val5'.split()])
df

       Val1      Val2      Val3      Val4      Val5
a  2.706850  0.628133  0.907969  0.503826  0.651118
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
d  0.955057  0.190794  1.978757  2.605967  0.683509
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

# Multiple Selection

In [18]:
df[['Val2','Val4']]

       Val2      Val4
a  0.628133  0.503826
b -0.848077 -2.018168
c -0.589001 -0.758872
d  0.190794  2.605967
e  1.693723 -1.159119

In [21]:
result=df[['Val1','Val5']]
result

       Val1      Val5
a  2.706850  0.651118
b -0.319318  0.740122
c  0.528813 -0.933237
d  0.955057  0.683509
e  0.302665 -0.134841

In [23]:
df['b':'d']

       Val1      Val2      Val3      Val4      Val5
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
d  0.955057  0.190794  1.978757  2.605967  0.683509

In [26]:
df[0:3]

       Val1      Val2      Val3      Val4      Val5
a  2.706850  0.628133  0.907969  0.503826  0.651118
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237

In [29]:
df['e':'e']

       Val1      Val2      Val3      Val4      Val5
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [30]:
df['e':'e'][['Val1','Val4']]

       Val1      Val4
e  0.302665 -1.159119

# LOC and ILOC

In [31]:
np.random.seed(101)

arr=np.random.randint(0,50,(10,5))
df=pd.DataFrame(data=arr,index='a b c d e f g h i j'.split(),columns=['Val1 Val2 Val3 Val4 Val5'.split()])

df

  Val1 Val2 Val3 Val4 Val5
a   31   11   17    6   23
b   11   47    9   13   40
c    4   40   28    0   46
d    5   12   29   40   49
e   19   47    8   29   34
f   44    8   19   10   12
g   31   43   23    0   41
h    9   47    8   36   19
i   35   28    7   10   39
j   38   46    9   18    7

In [32]:
df.loc['a':'c']

  Val1 Val2 Val3 Val4 Val5
a   31   11   17    6   23
b   11   47    9   13   40
c    4   40   28    0   46

In [33]:
df.iloc[0:3]

  Val1 Val2 Val3 Val4 Val5
a   31   11   17    6   23
b   11   47    9   13   40
c    4   40   28    0   46

In [34]:
df.loc['b','Val3']

Val3    9
Name: b, dtype: int32

In [36]:
df.iloc[1,2]

9

In [38]:
df.loc['b':'f','Val5']

  Val5
b   40
c   46
d   49
e   34
f   12

In [39]:
df.loc['b':'f',['Val5']]

  Val5
b   40
c   46
d   49
e   34
f   12

In [40]:
df.loc['a':'d'][['Val2']]

  Val2
a   11
b   47
c   40
d   12

In [41]:
df.iloc[3:6,3]

d    40
e    29
f    10
Name: (Val4,), dtype: int32

In [42]:
df.iloc[3:6,[3]]

  Val4
d   40
e   29
f   10

In [44]:
df.loc['b':'g','Val2':'Val4']

  Val2 Val3 Val4
b   47    9   13
c   40   28    0
d   12   29   40
e   47    8   29
f    8   19   10
g   43   23    0

In [48]:
df.iloc[1:7,1:4]

  Val2 Val3 Val4
b   47    9   13
c   40   28    0
d   12   29   40
e   47    8   29
f    8   19   10
g   43   23    0

In [50]:
df.iloc[1:7,1:4].loc['e':'f','Val2']

  Val2
e   47
f    8

# Conditional Selection

In [51]:
df>=25

    Val1   Val2   Val3   Val4   Val5
a   True  False  False  False  False
b  False   True  False  False   True
c  False   True   True  False   True
d  False  False   True   True   True
e  False   True  False   True   True
f   True  False  False  False  False
g   True   True  False  False   True
h  False   True  False   True  False
i   True   True  False  False   True
j   True   True  False  False  False

In [55]:
df[df>25]

   Val1  Val2  Val3  Val4  Val5
a  31.0   NaN   NaN   NaN   NaN
b   NaN  47.0   NaN   NaN  40.0
c   NaN  40.0  28.0   NaN  46.0
d   NaN   NaN  29.0  40.0  49.0
e   NaN  47.0   NaN  29.0  34.0
f  44.0   NaN   NaN   NaN   NaN
g  31.0  43.0   NaN   NaN  41.0
h   NaN  47.0   NaN  36.0   NaN
i  35.0  28.0   NaN   NaN  39.0
j  38.0  46.0   NaN   NaN   NaN

In [56]:
df['Val1']<15

    Val1
a  False
b   True
c   True
d   True
e  False
f  False
g  False
h   True
i  False
j  False

In [60]:
df[df['Val2']>20]

  Val1  Val2 Val3 Val4 Val5
a  NaN   NaN  NaN  NaN  NaN
b  NaN  47.0  NaN  NaN  NaN
c  NaN  40.0  NaN  NaN  NaN
d  NaN   NaN  NaN  NaN  NaN
e  NaN  47.0  NaN  NaN  NaN
f  NaN   NaN  NaN  NaN  NaN
g  NaN  43.0  NaN  NaN  NaN
h  NaN  47.0  NaN  NaN  NaN
i  NaN  28.0  NaN  NaN  NaN
j  NaN  46.0  NaN  NaN  NaN

In [73]:
df[df['Val1']>10][['Val2','Val3']]

  Val2 Val3
a  NaN  NaN
b  NaN  NaN
c  NaN  NaN
d  NaN  NaN
e  NaN  NaN
f  NaN  NaN
g  NaN  NaN
h  NaN  NaN
i  NaN  NaN
j  NaN  NaN

In [78]:
df[(df['Val1']>20) & (df['Val5']<20)]

  Val1 Val2 Val3 Val4 Val5
a  NaN  NaN  NaN  NaN  NaN
b  NaN  NaN  NaN  NaN  NaN
c  NaN  NaN  NaN  NaN  NaN
d  NaN  NaN  NaN  NaN  NaN
e  NaN  NaN  NaN  NaN  NaN
f  NaN  NaN  NaN  NaN  NaN
g  NaN  NaN  NaN  NaN  NaN
h  NaN  NaN  NaN  NaN  NaN
i  NaN  NaN  NaN  NaN  NaN
j  NaN  NaN  NaN  NaN  NaN